<?php
const AGE = 5;

/*
ЗАДАНИЕ 1
- Создайте константу и присвойте ей значение.
*/
?>
<!DOCTYPE html>
<html lang="ru">
<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<title>Константы</title>
</head>
<body>
	<h1>Константы</h1>
	<?php
    if (defined('AGE')){
        echo 'Константа существует, значение: ', AGE, PHP_EOL;
    }
    else{
        echo 'Константы не существует :(';
    }
    echo 'Текущая версия PHP: ', PHP_VERSION, PHP_EOL;
    echo 'Директория скрипта: ', __DIR__, PHP_EOL;
	/*
	ЗАДАНИЕ 2
	- Проверьте, существует ли константа, которую Вы хотите использовать.
	- Выведите значение созданной константы.
	ЗАДАНИЕ 3
	- Используя предопределённые в ядре константы выведите текущую версию PHP.
	- Используя магические константы выведите директорию скрипта.
	*/
	?>

</body>
</html>